server/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exam="http://www.examples.com/wsdl/MyService.wsdl">
    <soapenv:Header/>
    <soapenv:Body>
        <exam:MyFunction>
            <name>YourNameHere</name>
        </exam:MyFunction>
    </soapenv:Body>
</soapenv:Envelope>
